EventSamples/ALERT.KESI.IssueNew/2.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2" xmlns:wsa="http://www.w3.org/2005/08/addressing">
	<s:Header></s:Header>
	<s:Body>
		<wsnt:Notify>
			<wsnt:NotificationMessage>
				<wsnt:Topic></wsnt:Topic>
				<wsnt:ProducerReference>
					<wsa:Address>http://www.alert-project.eu/kesi</wsa:Address>
				</wsnt:ProducerReference>
				<wsnt:Message>
					<ns1:event xmlns:ns1="http://www.alert-project.eu/" xmlns:o="http://www.alert-project.eu/ontoevents-mdservice" xmlns:r="http://www.alert-project.eu/rawevents-forum" xmlns:r1="http://www.alert-project.eu/rawevents-mailinglist" xmlns:r2="http://www.alert-project.eu/rawevents-wiki" xmlns:s="http://www.alert-project.eu/strevents-kesi" xmlns:s1="http://www.alert-project.eu/strevents-keui" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.alert-project.eu/alert-root.xsd">
						<ns1:head>
							<ns1:sender>KESI</ns1:sender>
							<ns1:timestamp>10003</ns1:timestamp>
							<ns1:sequencenumber>1</ns1:sequencenumber>
						</ns1:head>
						<ns1:payload>
							<ns1:meta>
								<ns1:startTime>10010</ns1:startTime>
								<ns1:endTime>10020</ns1:endTime>
								<ns1:eventName>ALERT.KESI.IssueNew</ns1:eventName>
								<ns1:eventType>request</ns1:eventType>
							</ns1:meta>
							<ns1:eventData>
								<s:issue>
									<s:issueAuthor>
										<s:name>Sasa Stojanovic</s:name>
										<s:id>sasa.stojanovic@cimgrupa.eu</s:id>
										<s:email>sasa.stojanovic@cimgrupa.eu</s:email>
									</s:issueAuthor>
									<s:issueStatus>Fixed</s:issueStatus>
									<s:issueDescription>Description of issue</s:issueDescription>
									<s:issueKeyword>keywords</s:issueKeyword>
									<s:issueProduct>
										<s:productId>solid</s:productId>
										<s:productComponentId>general</s:productComponentId>
										<s:productVersion>unspecified</s:productVersion>
									</s:issueProduct>
									<s:issueComputerSystem>
										<s:computerSystemPlatform>Ubuntu Packages</s:computerSystemPlatform>
										<s:computerSystemOS>Linux</s:computerSystemOS>
									</s:issueComputerSystem>
									<s:issuePriority>4</s:issuePriority>
									<s:issueSeverity>Trivial</s:issueSeverity>
									<s:issueAssignedTo>
										<s:name>Nenad Ciric</s:name>
										<s:id>nenad.ciric@cimgrupa.eu</s:id>
										<s:email>nenad.ciric@cimgrupa.eu</s:email>
									</s:issueAssignedTo>
									<s:issueUrl>https://bugs.kde.org/show_bug.cgi?id=179351</s:issueUrl>
									<s:issueDateOpened>2011-05-16 11:25</s:issueDateOpened>
									<s:issueComment>
										<s:commentNumber>0</s:commentNumber>
										<s:commentText>If a driver is missing, clicking on the notification should open the package manager (by default) so the user can find a driver</s:commentText>
										<s:commentPerson>
											<s:name>Sasa Stojanovic</s:name>
											<s:id>sasa.stojanovic@cimgrupa.eu</s:id>
											<s:email>sasa.stojanovic@cimgrupa.eu</s:email>
										</s:commentPerson>
										<s:commentDate>2011-05-16 11:25</s:commentDate>
									</s:issueComment>
									<s:issueAttachment>
										<s:attachmentId>4545</s:attachmentId>
										<s:attachmentFilename>attachment name</s:attachmentFilename>
										<s:attachmentType>doc</s:attachmentType>
										<s:attachmentCreator>
											<s:name>Sasa Stojanovic</s:name>
											<s:id>sasa.stojanovic@cimgrupa.eu</s:id>
											<s:email>sasa.stojanovic@cimgrupa.eu</s:email>
										</s:attachmentCreator>
									</s:issueAttachment>
									<s:issueTracker>
										<s:issueTrackerId>241</s:issueTrackerId>
										<s:issueTrackerType>bugzilla</s:issueTrackerType>
										<s:issueTrackerURL>https://bugs.kde.org/</s:issueTrackerURL>
									</s:issueTracker>
								</s:issue>
							</ns1:eventData>
						</ns1:payload>
					</ns1:event>
				</wsnt:Message>
			</wsnt:NotificationMessage>
		</wsnt:Notify>
	</s:Body>
</s:Envelope>